Tekla.Structures.Drawing.ReinforcementPulloutElement.Font
The font of the dimension.

Tekla.Structures.Drawing.ReinforcementPulloutElement.AutomaticScaling
Whether the pull-out is scaled automatically or to a specified value.

Tekla.Structures.Drawing.ReinforcementPulloutElement.ScaleX
The scaling of the pull-out in the X direction.

Tekla.Structures.Drawing.ReinforcementPulloutElement.ScaleY
The scaling of the pull-out in the Y direction.

Tekla.Structures.Drawing.ReinforcementPulloutElement.RotationAxis
The rotation of the pull-out.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Exaggeration
Whether the pull-out is exaggerated.

Tekla.Structures.Drawing.ReinforcementPulloutElement.BendingRadius
Whether to show the pull-out bending radii.

Tekla.Structures.Drawing.ReinforcementPulloutElement.BendingAngle
Whether to show the pull-out bending angles.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Dimensioning
Whether to show the pull-out dimensions.

Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbolType
The type of the ending marks.